class AfterNamazDua{
  final String arabic;
  final String urdu;
  final String amount;
  AfterNamazDua({this.arabic, this.urdu, this.amount});
}

List<AfterNamazDua> afterNamaz = [
  AfterNamazDua(
    arabic: "اَللَّهُ أَ كْبَر",
    urdu:  "الله بہت بڑا ہے",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "أَسْتَغْفِرُ اللَّهَ",
    urdu: "میں اللہ سے معافی چاہتا ہوں",
    amount: "3 times after each namaz"
  ),
  AfterNamazDua(
    arabic: "اَللَّهُـمَّ أَنْتَ السَّـلاَمُ ، وَمِنْـكَ السَّـلاَمُ ، تَبَـا رَكْتَ يَاذَ الْجَـلاَ لِ وَا لْإِكْـرَامِ",
    urdu: "اے اللہ تو سلامتی ہے اور تجھی سے سلامتی (حاصل ہوتی ہے)۔ تو بڑی برکتوں والا ہے اے جلال و اکرام والے",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "اَللَّهُـمَّ أَعِنِّـيْ عَلَـى ذِكْرِكَ ، وَشُـكْـرِكَ ، وَحُسْـنِ عِبَا دَتِكَ",
    urdu: "اے اللہ آپ کو یاد کرنے ، آپ کا شکریہ ادا کرنے اور بہترین سلوک میں آپ کی عبادت کرنے میں میری مدد فرما",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "لاَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْـدَهُ لاَ شَـرِيْكَ لَـهُ ، لَـهُ الْمُـلْكُ وَلَهُ الْحَمْـدُ ، وَهُوَ عَلَـى كُلِّ شَـيْ ءٍ قَدِيرٌ، لاَ حَـوْلَ وَلاَ قُوَّةَ إِلاَّ بِا للَّهِ ، لاَ إِلَـٰهَ إِلاَّ اللَّهُ ، وَلاَ نَعْـبُدُ إِلاَّ إِيَاهُ ، لَـهُ النِّعْمَةُ وَلَـهُ الْفَضْـلُ ، وَلَـهُ الثَّنَاءُ الْحَسَـنُ ، لاَ إِلَـٰهَ إِلاَّ اللَّهُ مُخْلِصِـيْنَ لَـهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِـرُونَ",
    urdu: "اللہ کے سوا کسی کی عبادت کرنے کا حق نہیں ہے ، صرف تنہا ، شریک کے بغیر ، اس کی تمام خودمختاری اور تعریف ہے ، اور وہ ہر چیز پر قادر ہے۔ اللہ کے سوا کوئی طاقت یا طاقت نہیں ، اللہ کے سوا کسی کی عبادت کا حق نہیں ہے اور ہم اس کے سوا کسی کی عبادت نہیں کرتے ہیں۔ اس کے لئے سب احسان ، فضل ، اور شاندار تعریف ہے۔ اللہ کے سوا کسی کی عبادت کا حق نہیں ہے اور ہم اس کے ساتھ ایمان اور عقیدت میں مخلص ہیں حالانکہ کافر اس سے نفرت کرتے ہیں",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "سُبْحَانَ اللهِ",
    urdu: "اللہ بڑی عظمت والا ہے",
    amount: "33 times after each namaz",
  ),
  AfterNamazDua(
    arabic: "الْحَمْدُ للهِ",
    urdu: "سب تعریفیں الله کے لیے ہیں",
    amount: "33 times after each namaz",
  ),
  AfterNamazDua(
    arabic: "اللهُ أَكْبَرُ",
    urdu: "اللہ بہت بڑا ہے",
    amount: "33 times after each namaz",
  ),
  AfterNamazDua(
    arabic: "لاَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْـدَهُ   لاَ شَـرِيْكَ لَـهُ  ،  لَـهُ الْمُـلْكُ وَلَهُ الْحَمْـدُ  ،  وَهُـوَ عَلَـى كُلِّ شَـيْ  ءٍ   قَدِيْرٌ",
    urdu: "اللہ کے سوا کسی کی عبادت کرنے کا حق نہیں ہے ، تنہا ، بغیر شریک کے ، اسی کی تمام تر حاکمیت اور حمد ہے ، اور وہ ہر چیز پر قادر ہے",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "لاَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْـدَهُ لاَ شَـرِ يْكَ لَـهُ ، لَـهُ الْمُـلْكُ وَلَهُ الْحَمْـدُ ، يُحْـيِي وَيُمِـيْتُ وَهُـوَ عَلَـى كُلِّ شَـيْءٍ قَدِيرٌ",
    urdu: "اللہ کے سوا کسی کی عبادت کرنے کا حق نہیں ہے ، تنہا ، بغیر شریک کے ، اسی کی ساری بادشاہت اور حمد ہے ، وہ زندگی دیتا ہے اور موت دیتا ہے ، اور وہ ہر چیز پر قادر ہے۔",
    amount: "10 times after fajar and maghrib"
  ),
  AfterNamazDua(
    arabic: "اَ للَّهُـمَّ إِ نِّـيْ أَسْأَ لُكَ رِضَاكَ وَا لْجَنَّة ، وَأَعُوْذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
    urdu: "اے اللہ! ہم آپ سے دعا گو ہیں کہ ہم سے راضی ہوجائیں ، ہمیں جنت کا اجر دیں اور ہم آپ کے غضب اور آتشی  دوزخ سے تیری پناہ مانگتے ہیں",
    amount: "7 times after fajar and maghrib"
  ),
  AfterNamazDua(
    arabic: "اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    urdu: "خدا (وہ معبود برحق ہے کہ) اس کے سوا کوئی عبادت کے لائق نہیں زندہ ہمیشہ رہنے والا اسے نہ اونگھ آتی ہے نہ نیند جو کچھ آسمانوں میں اور جو کچھ زمین میں ہیں سب اسی کا ہے کون ہے جو اس کی اجازت کے بغیر اس سے (کسی کی) سفارش کر سکے جو کچھ لوگوں کے روبرو ہو رہا ہے اور جو کچھ ان کے پیچھے ہوچکا ہے اسے سب معلوم ہے اور وہ اس کی معلومات میں سے کسی چیز پر دسترس حاصل نہیں کر سکتے ہاں جس قدر وہ چاہتا ہے (اسی قدر معلوم کرا دیتا ہے) اس کی بادشاہی (اور علم) آسمان اور زمین سب پر حاوی ہے اور اسے ان کی حفاظت کچھ بھی دشوار نہیں وہ بڑا عالی رتبہ اور جلیل القدر ہے",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ۝ قُلْ هُوَ اللهُ أَحَدٌ ۝ اللهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
    urdu: "شروع الله کے نام سے جو بڑا مہربان نہایت رحم والا ہے ِکہو کہ وہ (ذات پاک جس کا نام) الله (ہے) ایک ہے . معبود برحق جو بےنیاز ہے .  نہ کسی کا باپ ہے اور نہ کسی کا بیٹا. اور کوئی اس کا ہمسر نہیں",
    amount: "1 time after Zohr, Asr and Isha\n3 times after Fajr and Maghrib"
  ),
  AfterNamazDua(
    arabic: "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ۝ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِنْ شَرِّ مَا خَلَقَ ۝ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    urdu: "شروع الله کے نام سے جو بڑا مہربان نہایت رحم والا ہے ِ. کہو کہ میں صبح کے پروردگار کی پناہ مانگتا ہوں . ہر چیز کی بدی سے جو اس نے پیدا کی . اور شب تاریکی کی برائی سے جب اس کااندھیرا چھا جائے . اور گنڈوں پر (پڑھ پڑھ کر) پھونکنے والیوں کی برائی سے . اور حسد کرنے والے کی برائی سے جب حسد کرنے لگے",
    amount: "1 time after Zohr, Asr and Isha\n3 times after Fajr and Maghrib"
  ),
  AfterNamazDua(
    arabic: "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ۝ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝  اِلٰهِ النَّاسِۙ‏  ۝ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ",
    urdu: "شروع الله کے نام سے جو بڑا مہربان نہایت رحم والا ہے ِ. کہو کہ میں لوگوں کے پروردگار کی پناہ مانگتا ہوں . (یعنی) لوگوں کے حقیقی بادشاہ کی . لوگوں کے معبود برحق کی . (شیطان) وسوسہ انداز کی برائی سے جو (خدا کا نام سن کر) پیچھے ہٹ جاتا ہے . جو لوگوں کے دلوں میں وسوسے ڈالتا ہے . وہ جنّات میں سے (ہو) یا انسانوں میں سے",
    amount: "1 time after Zohr, Asr and Isha\n3 times after Fajr and Maghrib"
  ),
  AfterNamazDua(
    arabic: "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ .إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ .إِنَّكَ حَمِيدٌ مَجِيدٌ",
    urdu: "اے اﷲ! رحمت نازل فرما محمد (ﷺ) پر اور آلِ محمد (ﷺ) پر جیسے تونے رحمت نازل فرمائی ابراہیم علیہ السلام پر اور آلِ ابراہیم علیہ السلام پر، یقیناً تو قابلِ تعریف، بڑی شان والا ہے۔ اے اﷲ! برکت نازل فرما محمد (ﷺ) پر اور آلِ محمد (ﷺ) پر جیسے تونے برکت نازل فرمائی ابراہیم علیہ السلام پر اور آلِ ابراہیم علیہ السلام پر، یقیناً تو قابلِ تعریف، بڑی شان والا ہے۔",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "للَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ ، وَمَا أَسْرَفْتُ ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ ، لَا إِلَهَ إِلَّا أَنْتَ",
    urdu: "اے اللہ مجھے ان گناہوں کے لئے معاف فرما جو واقع ہوئے ہیں اور ساتھ ہی ساتھ ہونے والے گناہوں کے لئے بھی ، اور میں نے جو چھپ چھپے ہوئے ہیں ان کے ساتھ ساتھ میں نے سرعام کردیا ہے ، اور جہاں میں نے بھی حد سے بڑھ کر ان گناہوں کو معاف کردیا ہے۔ جن چیزوں کے بارے میں آپ زیادہ جانتے ہو۔ آپ المقدم اور المومخر ہیں۔ تیرے سوا کسی کی عبادت کا حق نہیں ہے۔",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ",
    urdu: "اے اللہ جو تو عطا کرے اسے کوئی روکنے والا نہیں اور جسے تو روکے اسے کوئی دینے والا نہیں اور کسی نصیبہ ور کا نصیبہ تیرے مقابلہ میں اسے نفع نہیں پہنچا سکے گا ",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "ربِّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَک",
    urdu: "اے میرے رب مجھے اس دن اپنے عذاب سے بچا جس دن تم اپنے بندوں کو زندہ کرو گے",
    amount: "1 time after each namaz"
  ),
  AfterNamazDua(
    arabic: "اَللّٰھُمَّ اِنِّیْ اَعُوْذُبِکَ مِنَ الْکُفْرِ وَالْفَقْرِ و عَذَابِ الْقَبْرِ",
    urdu: "اے اللہ! یقینا میں تیری پناہ میں آتا ہوں کفر اور فقر و فاقہ سے اور عذاب قبر سے",
    amount: "1 time after each namaz"
  ),
];