class Hukum {
  String arabic;
  String ref;
  String urdu;
  String name;
  String naam;
  Hukum({this.arabic, this.ref, this.urdu, this.name, this.naam});
}

List<Hukum> ahkamaat = [
  Hukum(
    arabic: "فَبِمَا رَحۡمَةٍ مِّنَ اللّٰهِ لِنۡتَ لَهُمۡ‌ۚ وَلَوۡ كُنۡتَ فَظًّا غَلِيۡظَ الۡقَلۡبِ لَانْفَضُّوۡا مِنۡ حَوۡلِكَ‌ فَاعۡفُ عَنۡهُمۡ وَاسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِىۡ الۡاَمۡرِ‌ۚ فَاِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى اللّٰهِ‌ؕ اِنَّ اللّٰهَ يُحِبُّ الۡمُتَوَكِّلِيۡنَ",
    urdu: "اے محمدﷺ خدا کی مہربانی سے تمہاری افتاد مزاج ان لوگوں کے لئے نرم واقع ہوئی ہے۔ اور اگر تم بدخو اور سخت دل ہوتے تو یہ تمہارے پاس سے بھاگ کھڑے ہوتے۔ تو ان کو معاف کردو اور ان کے لئے (خدا سے) مغفرت مانگو۔ اور اپنے کاموں میں ان سے مشورت لیا کرو۔ اور جب (کسی کام کا) عزم مصمم کرلو تو خدا پر بھروسا رکھو۔ بےشک خدا بھروسا رکھنے والوں کو دوست رکھتا ہے",
    name: "Do not be rude in speech",
    naam: "گفتگو کے دوران شائستہ رہو",
    ref: "The Holy Quran 3:159"
  ),
  Hukum(
    arabic: "لَّذِيۡنَ يُنۡفِقُوۡنَ فِىۡ السَّرَّآءِ وَالضَّرَّآءِ وَالۡكٰظِمِيۡنَ الۡغَيۡظَ وَالۡعَافِيۡنَ عَنِ النَّاسِ‌ؕ وَاللّٰهُ يُحِبُّ الۡمُحۡسِنِيۡنَ‌ۚ‏ ",
    urdu: "جو آسودگی اور تنگی میں (اپنا مال خدا کی راہ میں) خرچ کرتےہیں اور غصے کو روکتے اور لوگوں کے قصور معاف کرتے ہیں اور خدا نیکو کاروں کو دوست رکھتا ہے",
    name: "Restrain Anger",
    naam: "غصہ پر قابو پالیں",
    ref: "The Holy Quran 3:134"
  ),
  Hukum(
    arabic: "وَاعۡبُدُوا اللّٰهَ وَلَا تُشۡرِكُوۡا بِهٖ شَيۡـًٔـا‌ؕ وَّبِالۡوَالِدَيۡنِ اِحۡسٰنًا وَّبِذِىۡ الۡقُرۡبٰى وَالۡيَتٰمٰى وَ الۡمَسٰكِيۡنِ وَالۡجَـارِ ذِى الۡقُرۡبٰى وَالۡجَـارِ الۡجُـنُبِ وَالصَّاحِبِ بِالۡجَـنۡۢبِ وَابۡنِ السَّبِيۡلِۙ وَمَا مَلَكَتۡ اَيۡمَانُكُمۡ‌ؕ اِنَّ اللّٰهَ لَا يُحِبُّ مَنۡ كَانَ مُخۡتَالاً فَخُوۡرَۙا‏ ",
    urdu: "اور خدا ہی کی عبادت کرو اور اس کے ساتھ کسی چیز کو شریک نہ بناؤ اور ماں باپ اور قرابت والوں اور یتیموں اور محتاجوں اور رشتہ دار ہمسائیوں اور اجنبی ہمسائیوں اور رفقائے پہلو (یعنی پاس بیٹھنے والوں) اور مسافروں اور جو لوگ تمہارے قبضے میں ہوں سب کے ساتھ احسان کرو کہ خدا (احسان کرنے والوں کو دوست رکھتا ہے اور) تکبر کرنے والے بڑائی مارنے والے کو دوست نہیں رکھتا",
    name: "Be good to others",
    naam: "دوسروں کے ساتھ اچھا سلوک کریں",
    ref: "The Holy Quran 4:36"
  ),
  Hukum(
    arabic: "قَالَ فَاهۡبِطۡ مِنۡهَا فَمَا يَكُوۡنُ لَـكَ اَنۡ تَتَكَبَّرَ فِيۡهَا فَاخۡرُجۡ اِنَّكَ مِنَ الصّٰغِرِيۡنَ‏ ",
    urdu: "فرمایا تو (بہشت سے) اتر جا تجھے شایاں نہیں کہ یہاں غرور کرے پس نکل جا۔ تو ذلیل ہے ",
    name: "Do not be arrogant",
    naam: "تکبر نہ کریں",
    ref: "The Holy Quran 7:13"
  ),
  Hukum(
    arabic: "خُذِ الۡعَفۡوَ وَاۡمُرۡ بِالۡعُرۡفِ وَاَعۡرِضۡ عَنِ الۡجٰهِلِيۡنَ",
    urdu: "اے محمدﷺ عفو اختیار کرو اور نیک کام کرنے کا حکم دو اور جاہلوں سے کنارہ کرلو ",
    ref: "The Holy Quran 7:199",
    name: "Forgive others for their mistakes",
    naam: "دوسروں کو ان کی غلطیوں پر معاف کریں"
  ),
  Hukum(
    arabic: "فَقُوۡلَا لَهٗ قَوۡلاً لَّيِّنًا لَّعَلَّهٗ يَتَذَكَّرُ اَوۡ يَخۡشٰى‏ ",
    urdu: "اور اس سے نرمی سے بات کرنا شاید وہ غور کرے یا ڈر جائے",
    ref: "The Holy Quran 20:44",
    name: "Speak to people mildly",
    naam: "لوگوں سے ہلکے سے بات کریں"
  ),
  Hukum(
    arabic: "الثلثة يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا يَسۡخَرۡ قَوۡمٌ مِّنۡ قَوۡمٍ عَسٰٓى اَنۡ يَّكُوۡنُوۡا خَيۡرًا مِّنۡهُمۡ وَلَا نِسَآءٌ مِّنۡ نِّسَآءٍ عَسٰٓى اَنۡ يَّكُنَّ خَيۡرًا مِّنۡهُنَّ‌ۚ وَلَا تَلۡمِزُوۡۤا اَنۡفُسَكُمۡ وَلَا تَنَابَزُوۡا بِالۡاَلۡقَابِ‌ؕ بِئۡسَ الِاسۡمُ الۡفُسُوۡقُ بَعۡدَ الۡاِيۡمَانِ‌ ۚ وَمَنۡ لَّمۡ يَتُبۡ فَاُولٰٓٮِٕكَ هُمُ الظّٰلِمُوۡنَ‏",
    urdu: "مومنو! کوئی قوم کسی قوم سے تمسخر نہ کرے ممکن ہے کہ وہ لوگ ان سے بہتر ہوں اور نہ عورتیں عورتوں سے (تمسخر کریں) ممکن ہے کہ وہ ان سے اچھی ہوں۔ اور اپنے (مومن بھائی) کو عیب نہ لگاؤ اور نہ ایک دوسرے کا برا نام رکھو۔ ایمان لانے کے بعد برا نام (رکھنا) گناہ ہے۔ اور جو توبہ نہ کریں وہ ظالم ہیں",
    ref: "The Holy Quran 49:11",
    name: "Do not ridicule one another",
    naam: "ایک دوسرے کی تضحیک نہ کریں"
  ),
  Hukum(
    arabic: "وَقَضٰى رَبُّكَ اَلَّا تَعۡبُدُوۡۤا اِلَّاۤ اِيَّاهُ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا‌ ؕ اِمَّا يَـبۡلُغَنَّ عِنۡدَكَ الۡكِبَرَ اَحَدُهُمَاۤ اَوۡ كِلٰهُمَا فَلَا تَقُل لَّهُمَاۤ اُفٍّ وَّلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلاً كَرِيۡمًا‏ ",
    urdu: "اور تمہارے پروردگار نے ارشاد فرمایا ہے کہ اس کے سوا کسی کی عبادت نہ کرو اور ماں باپ کے ساتھ بھلائی کرتے رہو۔ اگر ان میں سے ایک یا دونوں تمہارے سامنے بڑھاپے کو پہنچ جائیں تو اُن کو اُف تک نہ کہنا اور نہ انہیں جھڑکنا اور اُن سے بات ادب کے ساتھ کرنا",
    ref: "The Holy Quran 17:23",
    name: "Do not say a word of disrespect to your parents",
    naam: "اپنے والدین کی بے عزتی کا ایک لفظ مت کہو"
  ),
  Hukum(
    arabic: "وَاِذَا قِيۡلَ لَهُمُ اتَّبِعُوۡا مَآ اَنۡزَلَ اللّٰهُ قَالُوۡا بَلۡ نَتَّبِعُ مَآ اَلۡفَيۡنَا عَلَيۡهِ اٰبَآءَنَا ؕ اَوَلَوۡ كَانَ اٰبَآؤُهُمۡ لَا يَعۡقِلُوۡنَ شَيۡـًٔـا وَّلَا يَهۡتَدُوۡنَ‏ ",
    urdu: "اور جب ان لوگوں سے کہا جاتا ہے کہ جو (کتاب) خدا نے نازل فرمائی ہے اس کی پیروی کرو تو کہتے ہیں (نہیں) بلکہ ہم تو اسی چیز کی پیروی کریں گے جس پر ہم نے اپنے باپ دادا کو پایا۔ بھلا اگرچہ ان کے باپ دادا نہ کچھ سمجھتے ہوں اورنہ سیدھے رستے پر ہوں تب بھی وہ انہیں کی تقلید کئے جائیں گے",
    ref: "The Holy Quran 2:170",
    name: "Do not follow anyone blindly",
    naam: "کسی کی آنکھیں بند کر کے پیروی نہ کریں"
  ),
  Hukum(
    arabic: "وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ‌ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ‌ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ",
    urdu: "اور اگر قرض لینے والا تنگ دست ہو تو (اسے) کشائش (کے حاصل ہونے) تک مہلت (دو) اور اگر (زر قرض) بخش ہی دو توتمہارے لئے زیادہ اچھا ہے بشرطیکہ سمجھو ",
    ref: "The Holy Quran 2:280",
    name: "Grant more time to repay if the debtor is in hard times",
    naam: "اگر مقروض مشکل وقت میں ہے تو قرض ادا کرنے کے لئے مزید وقت دیں"
  ),
  Hukum(
    arabic: "وَلَا تَاۡكُلُوۡٓا اَمۡوَالَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ وَتُدۡلُوۡا بِهَآ اِلَى الۡحُکَّامِ لِتَاۡکُلُوۡا فَرِيۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَاَنۡتُمۡ تَعۡلَمُوۡنَ‏ ",
    urdu: "اور ایک دوسرے کا مال ناحق نہ کھاؤ اورنہ اس کو (رشوةً) حاکموں کے پاس پہنچاؤ تاکہ لوگوں کے مال کا کچھ حصہ ناجائز طور پر کھا جاؤ اور (اسے) تم جانتے بھی ہو ",
    ref: "The Holy Quran 2:188",
    name: "Do not engage in bribery",
    naam: "رشوت ستانی میں ملوث نہ ہوں"
  ),
  Hukum(
    arabic: "لَيۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡهَكُمۡ قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَلٰـكِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَالۡمَلٰٓٮِٕکَةِ وَالۡكِتٰبِ وَالنَّبِيّٖنَ‌ۚ وَاٰتَى الۡمَالَ عَلٰى حُبِّهٖ ذَوِى الۡقُرۡبٰى وَالۡيَتٰمٰى وَالۡمَسٰكِيۡنَ وَابۡنَ السَّبِيۡلِۙ وَالسَّآٮِٕلِيۡنَ وَفِىۡ الرِّقَابِ‌ۚ وَاَقَامَ الصَّلٰوةَ وَاٰتَى الزَّکٰوةَ‌ ۚ وَالۡمُوۡفُوۡنَ بِعَهۡدِهِمۡ اِذَا عٰهَدُوۡاۚ وَالصّٰبِرِيۡنَ فِىۡ الۡبَاۡسَآءِ وَالضَّرَّآءِ وَحِيۡنَ الۡبَاۡسِؕ اُولٰٓٮِٕكَ الَّذِيۡنَ صَدَقُوۡاؕ وَاُولٰٓٮِٕكَ هُمُ الۡمُتَّقُوۡنَ‏ ",
    urdu: "نیکی یہی نہیں کہ تم مشرق یا مغرب کو (قبلہ سمجھ کر ان) کی طرف منہ کرلو بلکہ نیکی یہ ہے کہ لوگ خدا پر اور روز آخرت پر اور فرشتوں پر اور (خدا کی) کتاب پر اور پیغمبروں پر ایمان لائیں۔ اور مال باوجود عزیز رکھنے کے رشتہ داروں اور یتیموں اور محتاجوں اور مسافروں اور مانگنے والوں کو دیں اور گردنوں (کے چھڑانے) میں (خرچ کریں) اور نماز پڑھیں اور زکوٰة دیں۔ اور جب عہد کرلیں تو اس کو پورا کریں۔ اور سختی اور تکلیف میں اور (معرکہ) کارزار کے وقت ثابت قدم رہیں۔ یہی لوگ ہیں جو (ایمان میں) سچے ہیں اور یہی ہیں جو (خدا سے) ڈرنے والے ہیں ",
    ref: "The Holy Quran 2:177",
    name: "Do not break promises",
    naam: "وعدوں کو نہ توڑیں"
  ),
  Hukum(
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا كُوۡنُوۡا قَوَّامِيۡنَ بِالۡقِسۡطِ شُهَدَآءَ لِلّٰهِ وَلَوۡ عَلٰٓى اَنۡفُسِكُمۡ اَوِ الۡوَالِدَيۡنِ وَالۡاَقۡرَبِيۡنَ‌ؕ اِنۡ يَّكُنۡ غَنِيًّا اَوۡ فَقِيۡرًا فَاللّٰهُ اَوۡلٰى بِهِمَا‌ فَلَا تَتَّبِعُوۡا الۡهَوٰٓى اَنۡ تَعۡدِلُوۡا‌ۚ وَاِنۡ تَلۡوٗۤا اَوۡ تُعۡرِضُوۡا فَاِنَّ اللّٰهَ كَانَ بِمَا تَعۡمَلُوۡنَ خَبِيۡرًا‏",
    urdu: "اے ایمان والو! انصاف پر قائم رہو اور خدا کے لئے سچی گواہی دو خواہ (اس میں) تمہارا یا تمہارےماں باپ اور رشتہ داروں کا نقصان ہی ہو۔ اگر کوئی امیر ہے یا فقیر تو خدا ان کا خیر خواہ ہے۔ تو تم خواہش نفس کے پیچھے چل کر عدل کو نہ چھوڑ دینا۔ اگر تم پیچیدا شہادت دو گے یا (شہادت سے) بچنا چاہو گے تو (جان رکھو) خدا تمہارے سب کاموں سے واقف ہے",
    ref: "The Holy Quran 4:135",
    name: "Stand out firmly for justice",
    naam: "انصاف کے لئے مضبوطی سے کھڑے ہوں"
  ),
  Hukum(
    arabic: "لِّلرِّجَالِ نَصِيۡبٌ مِّمَّا تَرَكَ الۡوَالِدٰنِ وَالۡاَقۡرَبُوۡنَ وَلِلنِّسَآءِ نَصِيۡبٌ مِّمَّا تَرَكَ الۡوَالِدٰنِ وَالۡاَقۡرَبُوۡنَ مِمَّا قَلَّ مِنۡهُ اَوۡ كَثُرَ‌ؕ نَصِيۡبًا مَّفۡرُوۡضًا‏ ",
    urdu: "جو مال ماں باپ اور رشتہ دار چھوڑ مریں تھوڑا ہو یا بہت۔ اس میں مردوں کا بھی حصہ ہے اور عورتوں کا بھی یہ حصے (خدا کے) مقرر کئے ہوئے ہیں",
    ref: "The Holy Quran 4:7",
    name: "Women also have the right for inheritance",
    naam: "خواتین کو وراثت کا بھی حق حاصل ہے"
  ),
  Hukum(
    arabic: "ىۡ الدُّنۡيَا وَالۡاٰخِرَةِؕ وَيَسۡـَٔـلُوۡنَكَ عَنِ الۡيَتٰمٰىؕ قُلۡ اِصۡلَاحٌ لَّهُمۡ خَيۡرٌؕ وَّاِنۡ تُخَالِطُوۡهُمۡ فَاِخۡوَانُكُمۡ‌ؕ وَاللّٰهُ يَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ‌ؕ وَلَوۡ شَآءَ اللّٰهُ لَاَعۡنَتَكُمۡؕ اِنَّ اللّٰهَ عَزِيۡزٌ حَكِيۡمٌ‏ ",
    urdu: " دنیا اور آخرت (کی باتوں) میں (غور کرو)۔ اور تم سے یتیموں کے بارے میں دریافت کرتے ہیں کہہ دو کہ ان کی (حالت کی) اصلاح بہت اچھا کام ہے۔ اور اگر تم ان سے مل جل کر رہنا (یعنی خرچ اکھٹا رکھنا) چاہو تو وہ تمہارے بھائی ہیں اور خدا خوب جانتا ہے کہ خرابی کرنے والا کون ہے اور اصلاح کرنے والا کون۔ اور اگر خدا چاہتا تو تم کو تکلیف میں ڈال دیتا۔بےشک خدا غالب (اور) حکمت والا ہے ",
    ref: "The Holy Quran 2:220",
    name: "Protect orphans",
    naam: "یتیموں کی حفاظت کرو"
  ),
  Hukum(
    arabic: "لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِىۡ الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ‌ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ‌ۚ لَا يَسۡـَٔـلُوۡنَ النَّاسَ اِلۡحَــافًا‌ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ",
    urdu: "اور ہاں تم جو خرچ کرو گے تو ان حاجتمندوں کے لئے جو خدا کی راہ میں رکے بیٹھے ہیں اور ملک میں کسی طرف جانے کی طاقت نہیں رکھتے (اور مانگنے سے عار رکھتے ہیں) یہاں تک کہ نہ مانگنے کی وجہ سے ناواقف شخص ان کو غنی خیال کرتا ہے اور تم قیافے سے ان کو صاف پہچان لو (کہ حاجتمند ہیں اور شرم کے سبب) لوگوں سے (منہ پھوڑ کر اور) لپٹ کر نہیں مانگ سکتے اور تم جو مال خرچ کرو گے کچھ شک نہیں کہ خدا اس کو جانتا ہے ",
    ref: "The Holy Quran 2:273",
    name: "Help those in need by finding them",
    naam: "ضرورت مندوں کی تلاش کرکے ان کی مدد کریں"
  ),
  Hukum(
    arabic: "اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَتَنۡسَوۡنَ اَنۡفُسَكُمۡ وَاَنۡتُمۡ تَتۡلُوۡنَ الۡكِتٰبَ‌ؕ اَفَلَا تَعۡقِلُوۡنَ‏ ",
    urdu: "کیا (عقل کی بات ہے کہ) تم لوگوں کو نیکی کرنے کو کہتے ہو اور اپنے تئیں فراموش کئے دیتے ہو، حالانکہ تم کتاب (خدا) بھی پڑھتے ہو۔ کیا تم سمجھتے نہیں؟ ",
    ref: "The Holy Quran 2:44",
    name: "Practice what you preach",
    naam: "جو آپ تبلیغ کرتے ہو اس پر عمل کریں"
  ),
  Hukum(
    arabic: "وَاِذِ اسۡتَسۡقَىٰ مُوۡسٰى لِقَوۡمِهٖ فَقُلۡنَا اضۡرِب بِّعَصَاكَ الۡحَجَرَ‌ؕ فَانفَجَرَتۡ مِنۡهُ اثۡنَتَا عَشۡرَةَ عَيۡنًا‌ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَهُمۡ‌ؕ کُلُوۡا وَاشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰهِ وَلَا تَعۡثَوۡا فِىۡ الۡاَرۡضِ مُفۡسِدِيۡنَ‏ ",
    urdu: "ور جب موسیٰ نے اپنی قوم کے لیے (خدا سے) پانی مانگا تو ہم نے کہا کہ اپنی لاٹھی پتھر پر مارو۔ (انہوں نے لاٹھی ماری) تو پھر اس میں سے بارہ چشمے پھوٹ نکلے، اور تمام لوگوں نے اپنا اپنا گھاٹ معلوم کر (کے پانی پی) لیا۔ (ہم نے حکم دیا کہ) خدا کی (عطا فرمائی ہوئی) روزی کھاؤ اور پیو، مگر زمین میں فساد نہ کرتے پھرنا",
    ref: "The Holy Quran 2:60",
    name: "Stay away from corruption",
    naam: "بدعنوانی سے دور رہیں"
  ),
  Hukum(
    name: "Fight only with those who fight you",
    naam: "صرف ان کے ساتھ لڑو جو آپ سے لڑتے ہیں",
    arabic: "وَقَاتِلُوۡا فِىۡ سَبِيۡلِ اللّٰهِ الَّذِيۡنَ يُقَاتِلُوۡنَكُمۡ وَلَا تَعۡتَدُوۡاؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُعۡتَدِيۡنَ‏ ",
    urdu: "اور جو لوگ تم سے لڑتے ہیں تم بھی خدا کی راہ میں ان سے لڑو مگر زیادتی نہ کرنا کہ خدا زیادتی کرنے والوں کو دوست نہیں رکھتا ",
    ref: "The Holy Quran 2:190",
  ),
  Hukum(
    name: "There is no compulsion in religion",
    naam: "مذہب میں کوئی جبر نہیں ہے",
    arabic: "لَاۤ اِكۡرَاهَ فِىۡ الدِّيۡنِ‌ۙ قَد تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَىِّ‌ۚ فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡۢ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقٰى لَا انْفِصَامَ لَهَا‌‌ ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ‏ ",
    urdu: "دین (اسلام) میں زبردستی نہیں ہے ہدایت (صاف طور پر ظاہر اور) گمراہی سے الگ ہو چکی ہے تو جو شخص بتوں سے اعتقاد نہ رکھے اور خدا پر ایمان لائے اس نے ایسی مضبوط رسی ہاتھ میں پکڑ لی ہے جو کبھی ٹوٹنے والی نہیں اور خدا (سب کچھ) سنتا اور (سب کچھ) جانتا ہے",
    ref: "The Holy Quran 2:256",
  ),
  Hukum(
    name: "Choose rulers by their merit",
    naam: "حکمرانوں کو ان کی خوبی سے منتخب کریں",
    arabic: "وَقَالَ لَهُمۡ نَبِيُّهُمۡ اِنَّ اللّٰهَ قَدۡ بَعَثَ لَـکُمۡ طَالُوۡتَ مَلِكًا‌ؕ قَالُوۡٓا اَنّٰى يَكُوۡنُ لَهُ الۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ اَحَقُّ بِالۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةً مِّنَ الۡمَالِ‌ؕ قَالَ اِنَّ اللّٰهَ اصۡطَفٰٮهُ عَلَيۡکُمۡ وَزَادَهٗ بَسۡطَةً فِىۡ الۡعِلۡمِ وَ الۡجِسۡمِ‌ؕ وَاللّٰهُ يُؤۡتِىۡ مُلۡکَهٗ مَنۡ يَّشَآءُ‌ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ",
    urdu: "اور پیغمبر نے ان سے (یہ بھی) کہا کہ خدا نے تم پر طالوت کو بادشاہ مقرر فرمایا ہے۔ وہ بولے کہ اسے ہم پر بادشاہی کا حق کیونکر ہوسکتا ہےبادشاہی کے مستحق تو ہم ہیں اور اس کے پاس تو بہت سی دولت بھی نہیں۔ پیغمبر نے کہا کہ خدا نےاس کو تم پر فضیلت دی ہے اور (بادشاہی کے لئے) منتخب فرمایا ہے اس نے اسے علم بھی بہت سا بخشا ہے اور تن و توش بھی (بڑا عطا کیا ہے) اور خدا (کو اختیار ہے) جسے چاہے بادشاہی بخشے۔ وہ بڑا کشائش والا اور دانا ہے",
    ref: "The Holy Quran 2:247",
  ),
  Hukum(
    name: "Do not burden a person beyond his scope",
    naam: "کسی شخص پر اس کی قابلیت سے زیادہ بوجھ مت ڈالو",
    arabic: "ا يُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّا وُسۡعَهَا‌ؕ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا اكۡتَسَبَتۡ‌ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ اِنۡ نَّسِيۡنَاۤ اَوۡ اَخۡطَاۡنَا‌ۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَاۤ اِصۡرًا كَمَا حَمَلۡتَهٗ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا‌‌ۚرَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهٖ‌ ۚ وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا اَنۡتَ مَوۡلٰٮنَا فَانصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ‏ ",
    urdu: "خدا کسی شخص کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا۔ اچھے کام کرے گا تو اس کو ان کا فائدہ ملے گا برے کرے گا تو اسے ان کا نقصان پہنچے گا۔ اے پروردگار اگر ہم سے بھول یا چوک ہوگئی ہو تو ہم سے مؤاخذہ نہ کیجیو۔ اے پروردگار ہم پر ایسا بوجھ نہ ڈالیو جیسا تو نے ہم سے پہلے لوگوں پر ڈالا تھا۔ اے پروردگار جتنا بوجھ اٹھانے کی ہم میں طاقت نہیں اتنا ہمارے سر پر نہ رکھیو۔ اور (اے پروردگار) ہمارے گناہوں سے درگزر کر اور ہمیں بخش دے۔ اور ہم پر رحم فرما۔ تو ہی ہمارا مالک ہے اور ہم کو کافروں پر غالب فرما ",
    ref: "The Holy Quran 2:286",
  ),
  Hukum(
    name: "Do not consume one another’s wealth unjustly",
    naam: "ایک دوسرے کے مال کا ناجائز استعمال نہ کریں",
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَاۡكُلُوۡۤا اَمۡوٰلَـكُمۡ بَيۡنَكُمۡ بِالۡبَاطِلِ اِلَّاۤ اَنۡ تَكُوۡنَ تِجٰرَةً عَنۡ تَرَاضٍ مِّنۡكُمۡ‌ وَلَا تَقۡتُلُوۡۤا اَنۡـفُسَكُمۡ‌ؕ اِنَّ اللّٰهَ كَانَ بِكُمۡ رَحِيۡمًا‏ ",
    urdu: "مومنو! ایک دوسرے کا مال ناحق نہ کھاؤ ہاں اگر آپس کی رضامندی سے تجارت کا لین دین ہو (اور اس سے مالی فائدہ حاصل ہو جائے تو وہ جائز ہے) اور اپنے آپ کو ہلاک نہ کرو کچھ شک نہیں کہ خدا تم پر مہربان ہے",
    ref: "The Holy Quran 4:29",
  ),
  Hukum(
    name: "Do not be miserly",
    naam: "بخل سے کام نہ لیں",
    arabic: "اۨلَّذِيۡنَ يَـبۡخَلُوۡنَ وَيَاۡمُرُوۡنَ النَّاسَ بِالۡبُخۡلِ وَيَكۡتُمُوۡنَ مَاۤ اٰتٰٮهُمُ اللّٰهُ مِنۡ فَضۡلِهٖ‌ؕ وَ اَعۡتَدۡنَا لِلۡكٰفِرِيۡنَ عَذَابًا مُّهِيۡنًا‌ۚ‏ ",
    urdu: "جو خود بھی بخل کریں اور لوگوں کو بھی بخل سکھائیں اور جو (مال) خدا نے ان کو اپنے فضل سے عطا فرمایا ہے اسے چھپا چھپا کے رکھیں اور ہم نے ناشکروں کے لئے ذلت کا عذاب تیار کر رکھا ہے",
    ref: "The Holy Quran 4:37",
  ),
  Hukum(
    name: "Do not be envious",
    naam: "حسد نہ کرو",
    arabic: "اَمۡ يَحۡسُدُوۡنَ النَّاسَ عَلٰى مَاۤ اٰتٰٮهُمُ اللّٰهُ مِنۡ فَضۡلِهٖ‌ۚ فَقَدۡ اٰتَيۡنَاۤ اٰلَ اِبۡرٰهِيۡمَ الۡـكِتٰبَ وَالۡحِكۡمَةَ وَاٰتَيۡنٰهُمۡ مُّلۡكًا عَظِيۡمًا‏ ",
    urdu: "یا جو خدا نے لوگوں کو اپنے فضل سے دے رکھا ہے اس کا حسد کرتے ہیں تو ہم نے خاندان ابراہیم ؑ کو کتاب اور دانائی عطا فرمائی تھی اور سلطنت عظیم بھی بخشی تھی",
    ref: "The Holy Quran 4:54",
  ),
  Hukum(
    name: "Do not be an advocate for deceit",
    naam: "دھوکہ دہی کے وکیل نہ بنو",
    arabic: "اِنَّاۤ اَنۡزَلۡنَاۤ اِلَيۡكَ الۡكِتٰبَ بِالۡحَـقِّ لِتَحۡكُمَ بَيۡنَ النَّاسِ بِمَاۤ اَرٰٮكَ اللّٰهُ‌ؕ وَلَا تَكُنۡ لِّـلۡخَآٮِٕنِيۡنَ خَصِيۡمًاۙ",
    urdu: "اے پیغمبر ہم نے تم پر سچی کتاب نازل کی ہے تاکہ خدا کی ہدایت کے مطابق لوگوں کے مقدمات میں فیصلہ کرو اور (دیکھو) دغابازوں کی حمایت میں کبھی بحث نہ کرنا",
    ref: "The Holy Quran 4:105",
  ),
  Hukum(
    name: "Judge with justice between people",
    naam: "لوگوں کے مابین انصاف کے ساتھ فیصلہ کریں",
    arabic: "اِنَّ اللّٰهَ يَاۡمُرُكُمۡ اَنۡ تُؤَدُّوۡا الۡاَمٰنٰتِ اِلٰٓى اَهۡلِهَاۙ وَاِذَا حَكَمۡتُمۡ بَيۡنَ النَّاسِ اَنۡ تَحۡكُمُوۡا بِالۡعَدۡلِ‌ؕ اِنَّ اللّٰهَ نِعِمَّا يَعِظُكُمۡ بِهٖ‌ؕ اِنَّ اللّٰهَ كَانَ سَمِيۡعَۢا بَصِيۡرًا‏ ",
    urdu: "خدا تم کو حکم دیتا ہے کہ امانت والوں کی امانتیں ان کے حوالے کردیا کرو اور جب لوگوں میں فیصلہ کرنے لگو تو انصاف سے فیصلہ کیا کرو خدا تمہیں بہت خوب نصیحت کرتا ہے بےشک خدا سنتا اور دیکھتا ہے",
    ref: "The Holy Quran 4:58",
  ),
  Hukum(
    name: "Try for settlement between people",
    naam: "لوگوں کے مابین تصفیہ کی کوشش کریں",
    arabic: "وَاِنۡ طَآٮِٕفَتٰنِ مِنَ الۡمُؤۡمِنِيۡنَ اقۡتَتَلُوۡا فَاَصۡلِحُوۡا بَيۡنَهُمَا‌ۚ فَاِنۡۢ بَغَتۡ اِحۡدٰٮهُمَا عَلَى الۡاُخۡرٰى فَقَاتِلُوۡا الَّتِىۡ تَبۡغِىۡ حَتّٰى تَفِىۡٓءَ اِلٰٓى اَمۡرِ اللّٰهِ ‌ۚ فَاِنۡ فَآءَتۡ فَاَصۡلِحُوۡا بَيۡنَهُمَا بِالۡعَدۡلِ وَاَقۡسِطُوۡا ؕ‌ اِنَّ اللّٰهَ يُحِبُّ الۡمُقۡسِطِيۡنَ‏",
    urdu: "اور اگر مومنوں میں سے کوئی دو فریق آپس میں لڑ پڑیں تو ان میں صلح کرا دو۔ اور اگر ایک فریق دوسرے پر زیادتی کرے تو زیادتی کرنے والے سے لڑو یہاں تک کہ وہ خدا کے حکم کی طرف رجوع لائے۔ پس جب وہ رجوع لائے تو وہ دونوں فریق میں مساوات کے ساتھ صلح کرا دو اور انصاف سے کام لو۔ کہ خدا انصاف کرنے والوں کو پسند کرتا ہے",
    ref: "The Holy Quran 49:9",
  ),
  Hukum(
    name: "Avoid assumption",
    naam: "مفروضے سے پرہیز کریں",
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا اجۡتَنِبُوۡا كَثِيۡرًا مِّنَ الظَّنِّ اِنَّ بَعۡضَ الظَّنِّ اِثۡمٌ‌ وَّلَا تَجَسَّسُوۡا وَلَا يَغۡتَبْ بَّعۡضُكُمۡ بَعۡضًا‌ؕ اَ يُحِبُّ اَحَدُكُمۡ اَنۡ يَّاۡكُلَ لَحۡمَ اَخِيۡهِ مَيۡتًا فَكَرِهۡتُمُوۡهُ‌ؕ وَاتَّقُوۡا اللّٰهَ‌ؕ اِنَّ اللّٰهَ تَوَّابٌ رَّحِيۡمٌ‏",
    urdu: "اے اہل ایمان! بہت گمان کرنے سے احتراز کرو کہ بعض گمان گناہ ہیں۔ اور ایک دوسرے کے حال کا تجسس نہ کیا کرو اور نہ کوئی کسی کی غیبت کرے۔ کیا تم میں سے کوئی اس بات کو پسند کرے گا کہ اپنے مرے ہوئے بھائی کا گوشت کھائے؟ اس سے تو تم ضرور نفرت کرو گے۔ (تو غیبت نہ کرو) اور خدا کا ڈر رکھو بےشک خدا توبہ قبول کرنے والا مہربان ہے",
    ref: "The Holy Quran 49:12",
  ),
  Hukum(
    name: "Do not spy and backbite",
    naam: "جاسوسی اور غیبت نہ کرو",
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا اجۡتَنِبُوۡا كَثِيۡرًا مِّنَ الظَّنِّ اِنَّ بَعۡضَ الظَّنِّ اِثۡمٌ‌ وَّلَا تَجَسَّسُوۡا وَلَا يَغۡتَبْ بَّعۡضُكُمۡ بَعۡضًا‌ؕ اَ يُحِبُّ اَحَدُكُمۡ اَنۡ يَّاۡكُلَ لَحۡمَ اَخِيۡهِ مَيۡتًا فَكَرِهۡتُمُوۡهُ‌ؕ وَاتَّقُوۡا اللّٰهَ‌ؕ اِنَّ اللّٰهَ تَوَّابٌ رَّحِيۡمٌ‏",
    urdu: "اے اہل ایمان! بہت گمان کرنے سے احتراز کرو کہ بعض گمان گناہ ہیں۔ اور ایک دوسرے کے حال کا تجسس نہ کیا کرو اور نہ کوئی کسی کی غیبت کرے۔ کیا تم میں سے کوئی اس بات کو پسند کرے گا کہ اپنے مرے ہوئے بھائی کا گوشت کھائے؟ اس سے تو تم ضرور نفرت کرو گے۔ (تو غیبت نہ کرو) اور خدا کا ڈر رکھو بےشک خدا توبہ قبول کرنے والا مہربان ہے",
    ref: "The Holy Quran 49:12",
  ),
  Hukum(
    name: "The most noble of you is the most righteous",
    naam: " تم میں زیادہ عزت والا وہ ہے جو زیادہ پرہیزگار ہے",
    arabic: "يٰۤاَيُّهَا النَّاسُ اِنَّا خَلَقۡنٰكُمۡ مِّنۡ ذَكَرٍ وَّاُنۡثٰى وَجَعَلۡنٰكُمۡ شُعُوۡبًا وَّقَبَآٮِٕلَ لِتَعَارَفُوۡا‌ؕ اِنَّ اَكۡرَمَكُمۡ عِنۡدَ اللّٰهِ اَتۡقٰٮكُمۡ‌ؕ اِنَّ اللّٰهَ عَلِيۡمٌ خَبِيۡرٌ‏ ",
    urdu: "لوگو! ہم نے تم کو ایک مرد اور ایک عورت سے پیدا کیا اور تمہاری قومیں اور قبیلے بنائے۔ تاکہ ایک دوسرے کو شناخت کرو۔ اور خدا کے نزدیک تم میں زیادہ عزت والا وہ ہے جو زیادہ پرہیزگار ہے۔ بےشک خدا سب کچھ جاننے والا (اور) سب سے خبردار ہے",
    ref: "The Holy Quran 49:13",
  ),
  Hukum(
    name: "Spend wealth in charity",
    naam: "صدقہ میں دولت خرچ کریں",
    arabic: "اٰمِنُوۡا بِاللّٰهِ وَرَسُوۡلِهٖ وَاَنۡفِقُوۡا مِمَّا جَعَلَـكُمۡ مُّسۡتَخۡلَفِيۡنَ فِيۡهِ‌ؕ فَالَّذِيۡنَ اٰمَنُوۡا مِنۡكُمۡ وَاَنۡفَقُوۡا لَهُمۡ اَجۡرٌ كَبِيۡرٌ",
    urdu: " خدا پر اور اس کے رسول پر ایمان لاؤ اور جس (مال) میں اس نے تم کو (اپنا) نائب بنایا ہے اس میں سے خرچ کرو۔ جو لوگ تم میں سے ایمان لائے اور (مال) خرچ کرتے رہے ان کے لئے بڑا ثواب ہے",
    ref: "The Holy Quran 57:7",
  ),
  Hukum(
    name: "Speak to the needy kindly",
    naam: "ضرورت مندوں کے ساتھ حسن معاشرت سے بات کریں",
    arabic: "وَاِمَّا تُعۡرِضَنَّ عَنۡهُمُ ابۡتِغَآءَ رَحۡمَةٍ مِّنۡ رَّبِّكَ تَرۡجُوۡهَا فَقُل لَّهُمۡ قَوۡلاً مَّيۡسُوۡرً‏ ",
    urdu: "اور اگر تم نے اپنے پروردگار کی رحمت (یعنی فراخ دستی) کے انتظار میں جس کی تمہیں امید ہو ان (مستحقین) کی طرف توجہ نہ کرسکو اُن سے نرمی سے بات کہہ دیا کرو ",
    ref: "The Holy Quran 17:28",
  ),
  Hukum(
    name: "Be dutiful towards your parents",
    naam: "اپنے والدین کے ساتھ بہترین برتاؤ کرو",
    arabic: "وَقَضٰى رَبُّكَ اَلَّا تَعۡبُدُوۡۤا اِلَّاۤ اِيَّاهُ وَبِالۡوَالِدَيۡنِ اِحۡسَانًا‌ ؕ اِمَّا يَـبۡلُغَنَّ عِنۡدَكَ الۡكِبَرَ اَحَدُهُمَاۤ اَوۡ كِلٰهُمَا فَلَا تَقُل لَّهُمَاۤ اُفٍّ وَّلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلاً كَرِيۡمًا‏ ",
    urdu: "اور تمہارے پروردگار نے ارشاد فرمایا ہے کہ اس کے سوا کسی کی عبادت نہ کرو اور ماں باپ کے ساتھ بھلائی کرتے رہو۔ اگر ان میں سے ایک یا دونوں تمہارے سامنے بڑھاپے کو پہنچ جائیں تو اُن کو اُف تک نہ کہنا اور نہ انہیں جھڑکنا اور اُن سے بات ادب کے ساتھ کرنا",
    ref: "The Holy Quran 17:23",
  ),
  Hukum(
    name: "Do not pursue that of which you have no knowledge",
    naam: "جس کے بارے میں تمہیں کچھ خبر نہ ہو اس کا پیچھا نہ کرو",
    arabic: "وَلَا تَقۡفُ مَا لَـيۡسَ لَـكَ بِهٖ عِلۡمٌ‌ؕ اِنَّ السَّمۡعَ وَالۡبَصَرَ وَالۡفُؤَادَ كُلُّ اُولٰۤٮِٕكَ كَانَ عَنۡهُ مَسۡـُٔوۡلاً‏ ",
    urdu: "اور (اے بندے) جس چیز کا تجھے علم نہیں اس کے پیچھے نہ پڑ۔ کہ کان اور آنکھ اور دل ان سب (جوارح) سے ضرور باز پرس ہوگی ",
    ref: "The Holy Quran 17:36",
  ),
  Hukum(
    name: "Honour your guests",
    naam: "اپنے مہمانوں کی عزت کرو",
    arabic: "فَرَاغَ اِلٰٓى اَهۡلِهٖ فَجَآءَ بِعِجۡلٍ سَمِيۡنٍۙ فَقَرَّبَهٗۤ اِلَيۡهِمۡ قَالَ اَلَا تَاۡكُلُوۡنَ",
    urdu: "تو اپنے گھر جا کر ایک (بھنا ہوا) موٹا بچھڑا لائے اور کھانے کے لئے ان کے آگے رکھ دیا۔ کہنے لگے کہ آپ تناول کیوں نہیں کرتے؟",
    ref: "The Holy Quran 51:26-27",
  ),
  Hukum(
    name: "Keep striving",
    naam: "جدوجہد کرتے رہیں",
    arabic: "وَاَنۡ لَّيۡسَ لِلۡاِنۡسَانِ اِلَّا مَا سَعٰىۙ‏",
    urdu: "اور یہ کہ انسان کو وہی ملتا ہے جس کی وہ کوشش کرتا ہے",
    ref: "The Holy Quran 53:39",
  ),
  Hukum(
    name: "Do not become divided",
    naam: "منقسم نہ بنو",
    arabic: "وَاعۡتَصِمُوۡا بِحَبۡلِ اللّٰهِ جَمِيۡعًا وَّلَا تَفَرَّقُوۡا‌ وَاذۡكُرُوۡا نِعۡمَتَ اللّٰهِ عَلَيۡكُمۡ اِذۡ كُنۡتُمۡ اَعۡدَآءً فَاَلَّفَ بَيۡنَ قُلُوۡبِكُمۡ فَاَصۡبَحۡتُمۡ بِنِعۡمَتِهٖۤ اِخۡوَانًاۚ وَكُنۡتُمۡ عَلٰى شَفَا حُفۡرَةٍ مِّنَ النَّارِ فَاَنۡقَذَكُمۡ مِّنۡهَا‌ؕ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَـكُمۡ اٰيٰتِهٖ لَعَلَّكُمۡ تَهۡتَدُوۡنَ‏ ",
    urdu: "اور سب مل کر خدا کی (ہدایت کی رسی) کو مضبوط پکڑے رہنا اور متفرق نہ ہونا اور خدا کی اس مہربانی کو یاد کرو جب تم ایک دوسرے کے دشمن تھے تو اس نے تمہارے دلوں میں الفت ڈال دی اور تم اس کی مہربانی سے بھائی بھائی ہوگئے اور تم آگ کے گڑھے کے کنارے تک پہنچ چکے تھے تو خدا نے تم کو اس سے بچا لیا اس طرح خدا تم کو اپنی آیتیں کھول کھول کر سناتا ہے تاکہ تم ہدایت پاؤ",
    ref: "The Holy Quran 3:103",
  ),
  Hukum(
    name: "Men and Women have equal rewards for their deeds",
    naam: "مردوں اور عورتوں کو ان کے اعمال کے برابر انعامات ہیں",
    arabic: "فَاسۡتَجَابَ لَهُمۡ رَبُّهُمۡ اَنِّىۡ لَاۤ اُضِيۡعُ عَمَلَ عَامِلٍ مِّنۡكُمۡ مِّنۡ ذَكَرٍ اَوۡ اُنۡثٰى‌‌ۚ بَعۡضُكُمۡ مِّنۡۢ بَعۡضٍ‌‌ۚ فَالَّذِيۡنَ هَاجَرُوۡا وَاُخۡرِجُوۡا مِنۡ دِيَارِهِمۡ وَاُوۡذُوۡا فِىۡ سَبِيۡلِىۡ وَقٰتَلُوۡا وَقُتِلُوۡا لَاُكَفِّرَنَّ عَنۡهُمۡ سَيِّاٰتِهِمۡ وَلَاُدۡخِلَنَّهُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ‌ۚ ثَوَابًا مِّنۡ عِنۡدِ اللّٰهِ‌ؕ وَ اللّٰهُ عِنۡدَهٗ حُسۡنُ الثَّوَابِ",
    urdu: "تو ان کے پرردگار نے ان کی دعا قبول کر لی (اور فرمایا) کہ میں کسی عمل کرنے والے کے عمل کو مرد ہو یا عورت ضائع نہیں کرتا تم ایک دوسرے کی جنس ہو تو جو لوگ میرے لیے وطن چھوڑ گئے اور اپنے گھروں سے نکالے گئے اور ستائے گئے اور لڑے اور قتل کیے گئے میں ان کے گناہ دور کردوں گا اور ان کو بہشتوں میں داخل کروں گا جن کے نیچے نہریں بہ رہی ہیں (یہ) خدا کے ہاں سے بدلہ ہے اور خدا کے ہاں اچھا بدلہ ہے",
    ref: "The Holy Quran 3:195",
  ),
  Hukum(
    name: "Stay away from sin and aggression",
    naam: "گناہ اور جارحیت سے دور رہیں",
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُحِلُّوۡا شَعَآءِرَ اللّٰهِ وَلَا الشَّهۡرَ الۡحَـرَامَ وَلَا الۡهَدۡىَ وَلَا الۡقَلَٓاٮِٕدَ وَلَاۤ آٰمِّيۡنَ الۡبَيۡتَ الۡحَـرَامَ يَبۡتَغُوۡنَ فَضۡلاً مِّنۡ رَّبِّهِمۡ وَرِضۡوٰنًا ‌ؕ وَاِذَا حَلَلۡتُمۡ فَاصۡطَادُوۡا‌ؕ وَلَا يَجۡرِمَنَّكُمۡ شَنَاٰنُ قَوۡمٍ اَنۡ صَدُّوۡكُمۡ عَنِ الۡمَسۡجِدِ الۡحَـرَامِ اَنۡ تَعۡتَدُوۡا‌ۘ وَتَعَاوَنُوۡا عَلَى الۡبِرِّ وَالتَّقۡوٰى‌ وَلَا تَعَاوَنُوۡا عَلَى الۡاِثۡمِ وَالۡعُدۡوَانِ‌ وَاتَّقُوۡا اللّٰهَ‌ؕ اِنَّ اللّٰهَ شَدِيۡدُ الۡعِقَابِ",
    urdu: "مومنو! خدا کے نام کی چیزوں کی بےحرمتی نہ کرنا اور نہ ادب کے مہینے کی اور نہ قربانی کے جانوروں کی اور نہ ان جانوروں کی (جو خدا کی نذر کر دیئے گئے ہوں اور) جن کے گلوں میں پٹے بندھے ہوں اور نہ ان لوگوں کی جو عزت کے گھر (یعنی بیت الله) کو جا رہے ہوں (اور) اپنے پروردگار کے فضل اور اس کی خوشنودی کے طلبگار ہوں اور جب احرام اتار دو تو (پھر اختیار ہے کہ) شکار کرو اور لوگوں کی دشمنی اس وجہ سے کہ انہوں نے تم کو عزت والی مسجد سے روکا تھا تمہیں اس بات پر آمادہ نہ کرے کہ تم ان پر زیادتی کرنے لگو اور (دیکھو) نیکی اور پرہیزگاری کے کاموں میں ایک دوسرے کی مدد کیا کرو اور گناہ اور ظلم کی باتوں میں مدد نہ کیا کرو اور خدا سے ڈرتے رہو۔ کچھ شک نہیں کہ خدا کا عذاب سخت ہے",
    ref: "The Holy Quran 5:2",
  ),
  Hukum(
    name: "Avoid intoxicants and alcohol",
    naam: "نشہ آور مشروب اور شراب سے پرہیز کریں",
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِنَّمَا الۡخَمۡرُ وَالۡمَيۡسِرُ وَالۡاَنۡصَابُ وَالۡاَزۡلَامُ رِجۡسٌ مِّنۡ عَمَلِ الشَّيۡطٰنِ فَاجۡتَنِبُوۡهُ لَعَلَّكُمۡ تُفۡلِحُوۡنَ",
    urdu: "اے ایمان والو! شراب اور جوا اور بت اور پاسے (یہ سب) ناپاک کام اعمال شیطان سے ہیں سو ان سے بچتے رہنا تاکہ نجات پاؤ",
    ref: "The Holy Quran 5:90",
  ),
  Hukum(
    name: "Do not gamble",
    naam: "جوا نہیں کھیلنا ",
    arabic: "اِنَّمَا يُرِيۡدُ الشَّيۡطٰنُ اَنۡ يُّوۡقِعَ بَيۡنَكُمُ الۡعَدَاوَةَ وَالۡبَغۡضَآءَ فِىۡ الۡخَمۡرِ وَالۡمَيۡسِرِ وَيَصُدَّكُمۡ عَنۡ ذِكۡرِ اللّٰهِ وَعَنِ الصَّلٰوةِ‌ۚ فَهَلۡ اَنۡتُمۡ مُّنۡتَهُوۡنَ‏ ",
    urdu: "شیطان تو یہ چاہتا ہے کہ شراب اور جوئے کے سبب تمہارے آپس میں دشمنی اور رنجش ڈلوا دے اور تمہیں خدا کی یاد سے اور نماز سے روک دے تو تم کو (ان کاموں سے) باز رہنا چاہیئے ",
    ref: "The Holy Quran 5:91",
  ),
  Hukum(
    name: "Do not insult others’ deities",
    naam: "دوسروں کے دیوتاؤں کی توہین نہ کریں",
    arabic: "وَلَا تَسُبُّوۡا الَّذِيۡنَ يَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰهِ فَيَسُبُّوا اللّٰهَ عَدۡوًۢا بِغَيۡرِ عِلۡمٍ‌ؕ كَذٰلِكَ زَيَّنَّا لِكُلِّ اُمَّةٍ عَمَلَهُمۡ ثُمَّ اِلٰى رَبِّهِمۡ مَّرۡجِعُهُمۡ فَيُنَبِّئُهُمۡ بِمَا كَانُوۡا يَعۡمَلُوۡنَ‏ ",
    urdu: "اور جن لوگوں کو یہ مشرک خدا کے سوا پکارتے ہیں ان کو برا نہ کہنا کہ یہ بھی کہیں خدا کو بےادبی سے بے سمجھے برا (نہ) کہہ بیٹھیں۔ اس طرح ہم نے ہر ایک فرقے کے اعمال (ان کی نظروں میں) اچھے کر دکھائے ہیں۔ پھر ان کو اپنے پروردگار ک طرف لوٹ کر جانا ہے تب وہ ان کو بتائے گا کہ وہ کیا کیا کرتے تھے",
    ref: "The Holy Quran 6:108",
  ),
  Hukum(
    name: "Eat and Drink, But Be Not Excessive",
    naam: "کھاؤ پیو ، لیکن ضرورت سے زیادہ نہیں",
    arabic: "يٰبَنِىۡۤ اٰدَمَ خُذُوۡا زِيۡنَتَكُمۡ عِنۡدَ كُلِّ مَسۡجِدٍ وَّكُلُوۡا وَاشۡرَبُوۡا وَلَا تُسۡرِفُوۡا‌ۚ اِنَّهٗ لَا يُحِبُّ الۡمُسۡرِفِيۡنَ",
    urdu: "اے بنی آدم! ہر نماز کے وقت اپنے تئیں مزّین کیا کرو اور کھاؤ اور پیؤ اور بےجا نہ اڑاؤ کہ خدا بےجا اڑانے والوں کو دوست نہیں رکھتا",
    ref: "The Holy Quran 7:31",
  ),
  Hukum(
    name: "Protect and help those who seek protection",
    naam: "حفاظت کے خواہاں افراد کی حفاظت اور مدد کریں",
    arabic: "وَاَنَّهٗ كَانَ رِجَالٌ مِّنَ الۡاِنۡسِ يَعُوۡذُوۡنَ بِرِجَالٍ مِّنَ الۡجِنِّ فَزَادُوۡهُمۡ رَهَقًاۙ",
    urdu: "اور یہ کہ بعض بنی آدم بعض جنات کی پناہ پکڑا کرتے تھے (اس سے) ان کی سرکشی اور بڑھ گئی تھی",
    ref: "The Holy Quran 9:6",
  ),
  Hukum(
    name: "Allah will forgive those who have done wrong out of ignorance",
    naam: "اللہ ان لوگوں کو معاف کرے گا جنہوں نے جاہلیت کی وجہ سے غلط کام کیا ہے",
    arabic: "ثُمَّ اِنَّ رَبَّكَ لِلَّذِيۡنَ عَمِلُوۡا السُّوۡۤءَ بِجَهَالَةٍ ثُمَّ تَابُوۡا مِنۡۢ بَعۡدِ ذٰلِكَ وَاَصۡلَحُوۡۤا اِنَّ رَبَّكَ مِنۡۢ بَعۡدِهَا لَغَفُوۡرٌ رَّحِيۡمٌ",
    urdu: "پھر جن لوگوں نے نادانی سے برا کام کیا۔ پھر اس کے بعد توبہ کی اور نیکوکار ہوگئے تو تمہارا پروردگار (ان کو) توبہ کرنے اور نیکوکار ہوجانے کے بعد بخشنے والا اور ان پر رحمت کرنے والا ہے",
    ref: "The Holy Quran 16:119",
  ),
  Hukum(
    name: "Invitation to God should be with wisdom and good instruction",
    naam: "خدا کی دعوت حکمت اور اچھی ہدایت کے ساتھ ہونی چاہئے",
    arabic: "اُدۡعُ اِلٰى سَبِيۡلِ رَبِّكَ بِالۡحِكۡمَةِ وَالۡمَوۡعِظَةِ الۡحَسَنَةِ‌ وَجَادِلۡهُمۡ بِالَّتِىۡ هِىَ اَحۡسَنُ‌ؕ اِنَّ رَبَّكَ هُوَ اَعۡلَمُ بِمَنۡ ضَلَّ عَنۡ سَبِيۡلِهٖ‌ وَهُوَ اَعۡلَمُ بِالۡمُهۡتَدِيۡنَ‏",
    urdu: "لوگوں کو دانش اور نیک نصیحت سے اپنے پروردگار کے رستے کی طرف بلاؤ۔ اور بہت ہی اچھے طریق سے ان سے مناظرہ کرو۔ جو اس کے رستے سے بھٹک گیا تمہارا پروردگار اسے بھی خوب جانتا ہے اور جو رستے پر چلنے والے ہیں ان سے بھی خوب واقف ہے",
    ref: "The Holy Quran 16:125",
  ),
  Hukum(
    name: "Keep aloof from what is vain",
    naam: "بیکار سے دور رہیں",
    arabic: "وَالَّذِيۡنَ هُمۡ عَنِ اللَّغۡوِ مُعۡرِضُوۡنَۙ‏",
    urdu: "اور جو بیہودہ باتوں سے منہ موڑے رہتے ہیں ",
    ref: "The Holy Quran 23:3",
  ),
  Hukum(
    name: "Do not enter others’ houses without seeking permission",
    naam: "اجازت کے بغیر دوسروں کے گھروں میں داخل نہ ہوں",
    arabic: "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تَدۡخُلُوۡا بُيُوۡتًا غَيۡرَ بُيُوۡتِكُمۡ حَتّٰى تَسۡتَاۡنِسُوۡا وَتُسَلِّمُوۡا عَلٰٓى اَهۡلِهَا‌ؕ ذٰلِكُمۡ خَيۡرٌ لَّـكُمۡ لَعَلَّكُمۡ تَذَكَّرُوۡنَ‏ ",
    urdu: "مومنو! اپنے گھروں کے سوا دوسرے (لوگوں کے) گھروں میں گھر والوں سے اجازت لئے اور ان کو سلام کئے بغیر داخل نہ ہوا کرو۔ یہ تمہارے حق میں بہتر ہے (اور ہم) یہ نصیحت اس لئے کرتے ہیں کہ شاید تم یاد رکھو",
    ref: "The Holy Quran 24:27",
  ),
  Hukum(
    name: "Walk on earth with humility",
    naam: "عاجزی کے ساتھ زمین پر چلو",
    arabic: "وَعِبَادُ الرَّحۡمٰنِ الَّذِيۡنَ يَمۡشُوۡنَ عَلَى الۡاَرۡضِ هَوۡنًا وَّاِذَا خَاطَبَهُمُ الۡجٰهِلُوۡنَ قَالُوۡا سَلٰمًا‏ ",
    urdu: "اور خدا کے بندے تو وہ ہیں جو زمین پر آہستگی سے چلتے ہیں اور جب جاہل لوگ ان سے (جاہلانہ) گفتگو کرتے ہیں تو سلام کہتے ہیں ",
    ref: "The Holy Quran 25:63",
  ),
  Hukum(
    name: "Do not neglect your portion of this world",
    naam: "اس دنیا کے اپنے حصے کو نظرانداز نہ کریں",
    arabic: "وَابۡتَغِ فِيۡمَاۤ اٰتٰٮكَ اللّٰهُ الدَّارَ الۡاٰخِرَةَ‌ وَلَا تَنۡسَ نَصِيۡبَكَ مِنَ الدُّنۡيَا‌ وَاَحۡسِنۡ كَمَاۤ اَحۡسَنَ اللّٰهُ اِلَيۡكَ‌ وَلَا تَبۡغِ الۡـفَسَادَ فِىۡ الۡاَرۡضِ‌ؕ اِنَّ اللّٰهَ لَا يُحِبُّ الۡمُفۡسِدِيۡنَ‏",
    urdu: "اور جو (مال) تم کو خدا نے عطا فرمایا ہے اس سے آخرت کی بھلائی طلب کیجئے اور دنیا سے اپنا حصہ نہ بھلائیے اور جیسی خدا نے تم سے بھلائی کی ہے (ویسی) تم بھی (لوگوں سے) بھلائی کرو۔ اور ملک میں طالب فساد نہ ہو۔ کیونکہ خدا فساد کرنے والوں کو دوست نہیں رکھتا ",
    ref: "The Holy Quran 28:77",
  ),
  Hukum(
    name: "Enjoin right, forbid wrong",
    naam: "صحیح سے حکم دیں ، غلط سے منع کریں",
    arabic: "يٰبُنَىَّ اَقِمِ الصَّلٰوةَ وَاۡمُرۡ بِالۡمَعۡرُوۡفِ وَانۡهَ عَنِ الۡمُنۡكَرِ وَاصۡبِرۡ عَلٰى مَاۤ اَصَابَكَ‌ؕ اِنَّ ذٰلِكَ مِنۡ عَزۡمِ الۡاُمُوۡرِ‌ۚ",
    urdu: "بیٹا نماز کی پابندی رکھنا اور (لوگوں کو) اچھے کاموں کے کرنے کا امر اور بری باتوں سے منع کرتے رہنا اور جو مصیبت تجھ پر واقع ہو اس پر صبر کرنا۔ بیشک یہ بڑی ہمت کے کام ہیں",
    ref: "The Holy Quran 31:17",
  ),
  Hukum(
    name: "Women should not display their finery",
    naam: "عورتیں اپنی زینت کا دکھاوا نہ کریں",
    arabic: "وَقَرۡنَ فِىۡ بُيُوۡتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ الۡجَاهِلِيَّةِ الۡاُوۡلٰى وَاَقِمۡنَ الصَّلٰوةَ وَاٰتِيۡنَ الزَّكٰوةَ وَاَطِعۡنَ اللّٰهَ وَرَسُوۡلَهٗ  ؕ اِنَّمَا يُرِيۡدُ اللّٰهُ لِيُذۡهِبَ عَنۡكُمُ الرِّجۡسَ اَهۡلَ الۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيۡرًاۚ‏",
    urdu: "اور اپنے گھروں میں ٹھہری رہو اور جس طرح (پہلے) جاہلیت (کے دنوں) میں اظہار تجمل کرتی تھیں اس طرح زینت نہ دکھاؤ۔ اور نماز پڑھتی رہو اور زکوٰة دیتی رہو اور خدا اور اس کے رسول کی فرمانبرداری کرتی رہو۔ اے (پیغمبر کے) اہل بیت خدا چاہتا ہے کہ تم سے ناپاکی (کا میل کچیل) دور کردے اور تمہیں بالکل پاک صاف کردے",
    ref: "The Holy Quran 33:33",
  ),
  Hukum(
    name: "Do not despair of the mercy of Allah",
    naam: "اللہ کی رحمت سے مایوس نہ ہوں",
    arabic: "قُلۡ يٰعِبَادِىَ الَّذِيۡنَ اَسۡرَفُوۡا عَلٰٓى اَنۡفُسِهِمۡ لَا تَقۡنَطُوۡا مِنۡ رَّحۡمَةِ اللّٰهِ‌ؕ اِنَّ اللّٰهَ يَغۡفِرُ الذُّنُوۡبَ جَمِيۡعًا‌ؕ اِنَّهٗ هُوَ الۡغَفُوۡرُ الرَّحِيۡمُ",
    urdu: "کہہ دو کہ اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی ہے خدا کی رحمت سے ناامید نہ ہونا۔ خدا تو سب گناہوں کو بخش دیتا ہے۔ (اور) وہ تو بخشنے والا مہربان ہے",
    ref: "The Holy Quran 39:53",
  ),
  Hukum(
    name: "Decide on affairs by consultation",
    naam: "امور کا مشورہ کرکے فیصلہ کریں",
    arabic: "وَالَّذِيۡنَ اسۡتَجَابُوۡا لِرَبِّهِمۡ وَاَقَامُوۡا الصَّلٰوةَ وَاَمۡرُهُمۡ شُوۡرٰى بَيۡنَهُمۡ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَ‌ۚ‏",
    urdu: "اور جو اپنے پروردگار کا فرمان قبول کرتے ہیں اور نماز پڑھتے ہیں۔ اور اپنے کام آپس کے مشورے سے کرتے ہیں۔ اور جو مال ہم نے ان کو عطا فرمایا ہے اس میں سے خرچ کرتے ہیں",
    ref: "The Holy Quran 42:38",
  ),
  Hukum(
    name: "Act justly to people of all faiths",
    naam: "تمام مذاہب کے لوگوں کے ساتھ انصاف کے ساتھ کام کریں",
    arabic: "ا يَنۡهٰٮكُمُ اللّٰهُ عَنِ الَّذِيۡنَ لَمۡ يُقَاتِلُوۡكُمۡ فِىۡ الدِّيۡنِ وَلَمۡ يُخۡرِجُوۡكُمۡ مِّنۡ دِيَارِكُمۡ اَنۡ تَبَرُّوۡهُمۡ وَ تُقۡسِطُوۡۤا اِلَيۡهِمۡ‌ؕ اِنَّ اللّٰهَ يُحِبُّ الۡمُقۡسِطِيۡنَ‏",
    urdu: "جن لوگوں نے تم سے دین کے بارے میں جنگ نہیں کی اور نہ تم کو تمہارے گھروں سے نکالا ان کے ساتھ بھلائی اور انصاف کا سلوک کرنے سے خدا تم کو منع نہیں کرتا۔ خدا تو انصاف کرنے والوں کو دوست رکھتا ہے",
    ref: "The Holy Quran 60:8",
  ),
];