Map<String, String> duaFinder(String currentItem) {
    Map<String, String> _res = {'dua': '', 'translation': ''};
    switch (currentItem) {
      case '[Select Emotion]':
        _res['dua'] = '';
        _res['translation'] = '';
        break;
      case 'angry    غصہ':
        _res['dua'] = '\n\n اللَّهُمَّ أَذْهِبْ غَيْظَ قَلْبِي';
        _res['translation'] = 'اے اللہ، میرے دل سے غصہ دور کر دے';
        break;
      case 'anticipation   توقع':
        _res['dua'] =
            'للَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ';
        _res['translation'] =
            ' اے اللہ اگر تو جانتا ہے کہ    بے شک یہ کا م میرے لئے میرے دین ، میرے معاش اور میرے انجا م کار کے لحاظ سے بہتر ہے تو اس کا میرے حق میں فیصلہ کر دے اور اسے میرے لئے آسان کر دے ، پھر میرے لئے اس میں برکت ڈال دے ';
        break;
      case 'anxious    فکر مند':
        _res['dua'] = 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ';
        _res['translation'] = 'اے اللہ ، میں آپ کو اضطراب اور غم ، کمزوری اور کاہلی ، بداخلاقی اور بزدلی ، قرضوں کے بوجھ اور انسانوں کے طاقت سے زیادہ ہونے سے پناہ مانگتا ہوں';
        break;
      case 'confident  پر اعتماد':
        _res['dua'] = 'یا رَبْ إذا أعطيتني مَالاً فلا تأخذ سَعادتي، وإذا أعَطيتني قوّة فلا تأخذ عقليْ، وإذا أعَطيتني نجَاحاً فلا تأخذ تَواضعْي وإذا أعطيتني تواضعاً فلا تأخذ اعتزازي بِكرامتیی';
        _res['translation'] = 'اے  رب! جب آپ مجھے دولت دیں تو میری خوشی کو دور نہ کریں۔ جب آپ مجھے طاقت دیں تو میری ذہانت کو دور نہ کریں۔ جب آپ مجھے فتح دیں تو میری عاجزی کو دور نہ کریں۔ جب آپ مجھے عاجزی دیں تو میری عظمت کو نہ ہٹایں';
        break;
      case 'confused   پریشان':
        _res['dua'] = 'اللهمّ اجعل في قلبي نوراً، وفي لساني نوراً، واجعل في سمعي نوراً، واجعل في بصري نوراً، واجعل من خلفي ‏نوراً، ومن أمامي نوراً، واجعل من فوقي نوراً، ومن تحتي نوراً، اللهمّ أعطني نوراً';
        _res['translation'] = 'اے اللہ! میرے دل میں نور رکھیں ، میری زبان میں نور رکھیں ،  میری سماعت میں نور رکھیں ،  میری نظر میں نور رکھیں ، . میرے پیچھے نور رکھیں ،  میرے سامنے نور رکھیں ،  میرے اوپر نور رکھیں ،  میرے نیچے نور رکھیں۔ اے اللہ مجھے نور عطا فرمائے! ';
        break;
      case 'curious    متجسس':
        _res['dua'] = 'اللهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر منيي';
        _res['translation'] = 'اے اللہ ، میں آپ سے اپنی سماعت کی برائی ، اپنی نظر کی برائی ، زبان کی برائی ، اپنے دل کی برائی اور اپنے آپ کے شر سے حفاظت مانگتا ہوں';
        break;
      case 'defeated   شکست خوردہ':
        _res['dua'] = 'اللهمّ إنّي ظلمت نفسي ظلماً كثيراً، ولا يغفر الذّنوب إلا أنت فاغفر لي مغفرة من عندك، وارحمني إنّك أنت الغفور الرّحيم';
        _res['translation'] = 'اے اللہ ، میں اپنے ساتھ بہت ظلم کرتا ہوں اور تیرے علاوہ کوئی بھی گناہ سے معافی نہیں دیتا ہے ، لہذا تو مجھے معافی بخش اور مجھ پر رحم فرما۔ بےشک تو بخشنے والا مہربان ہے';
        break;
      case 'depressed    اداس':
        _res['dua'] = 'اللهم اخرجني من الظلمات إلى النور';
        _res['translation'] = 'اے اللہ مجھے اندھیروں سے نکال کر روشنی میں لے جائیں';
        break;
      case 'desire   خواہشمند':
        _res['dua'] = 'اللهم اطفئ نار الشهوات من قلبى ، واصرف عنه كل شئ لا يرضيك عنى';
        _res['translation'] ='اے اللہ! میرے دل میں خواہشات کی آگ بجھو اور میرے دل کو ہر وہ چیز کی طرف رجوع کریں جو آپ کو راضی ہے';
        break;
      case 'desperate    بیتاب':
        _res['dua'] = 'اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت ربُّ المستضعفين وانت ربّي';
        _res['translation'] = 'اے میرے رب ، میں آپ سے اپنی کمزوری ، مدد کی کمی اور مجھے ذلت کا سامنا کرنے کی شکایت کرتا ہوں۔ نہایت رحم کرنے والا اور رحم کرنے والا! آپ کمزوروں کا رب ہے ، اور آپ میرے رب ہیں۔';
        break;
      case 'determined   پُر عزم':
        _res['dua'] = 'اللهم امنحني القوة لأقاوم نفسي، والشجاعة لأواجه ضعفي، واليقين لأتقبل قدري، والرضا ليرتاح عقلي، والفهم ليطمئن قلبي';
        _res['translation'] = 'اے اللہ! مجھے خود کی مخالفت کرنے کی طاقت ، اپنی کمزوری کا سامنا کرنے کی ہمت ، اپنے عقیدے کو قبول کرنے کا یقین ، میرے دماغ کو سکون بخشنے کا اطمینان ، اور اپنے دل کو راحت بخش کرنے کی تفہیم عطا کریں۔';
        break;
      case 'disbelief    بے اعتباری':
        _res['dua'] = 'اللهم املأ قلبى بحبك';
        _res['translation'] = 'اے اللہ میرے دل کو آپ کی محبت سے بھر دے';
        break;
      case 'doubtful   شکی':
        _res['dua'] = 'اللهم إن كان هذا الأمر خيرا لي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ';
        _res['translation'] = 'اے اللہ ، اگر میرا ارادہ عمل میرے لئے بہترین ہے تو ، اسے میرے لئے مقدر اور آسان بنا دے ، اور مجھے اس میں اپنی برکت عطا فرما۔';
        break;
      case 'envious    حسد':
        _res['dua'] = 'اللهم طهر قلبي من كل سوء ، اللهم طهر قلبي من كل ما يبغضك، اللهم طهر قلبي من كل غلٍ وحقدٍ وحسد وكبر';
        _res['translation'] = 'اے اللہ ، ہر طرح کی برائی کو میرے دل سے پاک کردے۔ اے اللہ ، میرے دل کو صاف کردے اور ہر وہ شے دور  کردے جو آپ کو ناپسند ہے۔ یا اللہ ، ہر طرح کی تلخی ، سخت احساسات اور حسد سے میرے دل کو صاف کردے۔ ';
        break;
      case 'grateful   شکر گزار':
        _res['dua'] = 'اللهم إن شكرك نعمة، تستحق الشكر، فعلّمني كيف أشكرك ، الحمد لله كما ينبغى لجلال وجهك وعظيم سلطانك';
        _res['translation'] = 'اے  اللہ آپ کا شکر ادا کرنا ایک نعمت ہے ، آپ تمام شکر گزاری کے حقڈار ہیں۔ تمام تعریفیں اللہ ہی کے لئیے ہیں جس طرح وہ اپنی شان و شوکت کے  مستحق ہے';
        break;
      case 'guilty   گناہگار':
        _res['dua'] = 'يارب أمسح على صدري برحمتك';
        _res['translation'] = 'اے خداوند ، اپنی رحمت سے میرے سینے کو صاف کردے';
        break;
      case 'happy    خوش':
        _res['dua'] = 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ';
        _res['translation'] = 'اے اللہ! میں آپ کی برکتوں کے زوال ، سلامتی کے انتقال ، اچانک آپ کے عذاب کے آغاز سے اور ان سب چیزوں سے پناہ چاہتا ہوں جو آپ کو ناگوار کرتے ہیں۔';
        break;
      case 'hatred   نفرت':
        _res['dua'] = 'اللهم لا تجعل في قلبي كراهية لأحد';
        _res['translation'] = 'یا اللہ ، کسی کے لئیے نفرت میرے دل میں نہ رہنے دے';
        break;
      case 'humiliated   ذلیل':
        _res['dua'] = 'اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت ربُّ المستضعفين وانت ربّي';
        _res['translation'] = 'اے میرے رب ، میں آپ سے اپنی کمزوری ، مدد کی کمی اور مجھے ذلت کا سامنا کرنے کی شکایت کرتا ہوں۔ نہایت رحم کرنے والا اور رحم کرنے والا! آپ کمزوروں کا رب ہے ، اور آپ میرے رب ہیں۔';
        break;
      case 'hurt   مجروح':
        _res['dua'] ='اللهم لا تعلق قلبي الضعيف بما ليس بي';
        _res['translation'] ='یا اللہ ، میرے کمزور دل کو اس چیز سے جوڑنے نہ دیں جو میری  نہیں ہے';
        break;
      case 'impatient    بے چین':
        _res['dua'] = 'يا صبور صبّرني على ما بلوتني وامتحنتني';
        _res['translation'] = 'اے سب سے زیادہ صبر کرنے والے ، مجھے اس  قابل بنائیں کہ آپ جو بھی امتحان  دیں یا وقتی تکلیف دیں اس میں ثابتقدم رہوں';
        break;
      case 'indicisive   فیصلہ نہ کر پانا':
        _res['dua'] = 'اللهم إن كان هذا الأمر خيرا لي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ';
        _res['translation'] = 'اے اللہ ، اگر میرا ارادہ عمل میرے لئے بہترین ہے تو ، اسے میرے لئے مقدر اور آسان بنا دے ، اور مجھے اس میں اپنی برکت عطا فرما۔';
        break;
      case 'insecure   غیر محفوظ':
        _res['dua'] = 'اللهم اجعلني أرى المواهب و نقاط قوت الذين وضعته في نفسي';
        _res['translation'] = 'اے اللہ مجھے آپ ان  صلاحیتوں اور طاقتوں کو دیکھنے کے لائیق بنائیں جو آپ نے میرے اندر رکھی ہیں۔';
        break;
      case 'irritated  چڑچڑا':
        _res['dua'] = 'اللهم طهر قلبي من كل سوء ، اللهم طهر قلبي من كل ما يبغضك، اللهم طهر قلبي من كل غلٍ وحقدٍ وحسد وكبر';
        _res['translation'] = 'اے اللہ ، ہر طرح کی برائی کو میرے دل سے پاک کردے۔ اے اللہ ، میرے دل کو صاف کردے اور ہر وہ شے دور  کردے جو آپ کو ناپسند ہے۔ یا اللہ ، ہر طرح کی تلخی ، سخت احساسات اور حسد سے میرے دل کو صاف کردے۔ ';
        break;  
      case 'lazy   سست':
        _res['dua'] = 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ';
        _res['translation'] =  'اے اللہ ، میں آپ کو اضطراب اور غم ، کمزوری اور کاہلی ، بداخلاقی اور بزدلی ، قرضوں کے بوجھ اور انسانوں کے طاقت سے زیادہ ہونے سے پناہ مانگتا ہوں';
        break;
      case 'lonely   تنہا':
        _res['dua'] = 'اللهُمَّ رَحْمَتَكَ أرجُو، فَلا تَكِلْنِي إلى نَفْسي طَرْفَةَ عَيْنٍ، وأصْلِحْ لي شَأني كُلَّهُ، لا إله إلا أنْتَ.';
        _res['translation'] = 'اے اللہ ، یہ آپ کی رحمت ہے جس کی مجھے امید ہے ، لہذا مجھے ایک پلک جھپکنے  کے لئے بھی میرے معاملات کی ذمہ داری مجھ پر  نہ چھوڑیں ، اور میرے تمام معاملات میرے لئے اصلاح فرمائیں۔ تیرے سوا کوئی عبادت کا ھؤحقدار نہیں ہے';
        break;
      case 'nervous  اعصابی':
        _res['dua'] = 'رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي';
        _res['translation'] = 'اے میرے رب! میرا سینہ میرے لئے کھول دے اور میرے کام کو مجھ پر آسان کر دے اور میری زبان کی گرہ بھی کھول دے تاکہ لوگ میری اچھی طرح بات سمجھ سکیں۔';
        break;
      case 'nostalgic    ماضی پرستی':
        _res['dua'] = 'اللهم لا تعلق قلبي الضعيف بما ليس لي';
        _res['translation'] ='یا اللہ ، میرے کمزور دل کو اس چیز سے جوڑنے نہ دیں جو میری  نہیں ہے';
        break;
      case 'offended   برا ماننا':
        _res['dua'] = 'ْاللهم إنِّي أَعُوْذُ بِكَ مِنْ هَمِّ يَحْزُنُنِي وَمِنْ فِكْرِ يُقْلِقُنِيْ وَعِلْمَا يُتْعِبُنِيْ وَشَخْصَا يَحْمِلُ خُبْثَا لِي';
        _res['translation'] = 'اے اللہ! میں ان پریشانیوں سے آپ کی پناہ مانگتا ہوں جن سے مجھے غم ہوتا ہے ، وہ خیالات جو مجھے بے چین کردیتے ہیں ، ایسی معلومات جو مجھے پریشان کرتی ہیں ، اور وہ لوگ جو میرے لئے برا چاہتے ہیں۔';
        break;
      case 'over-whelmed   مغلوب':
        _res['dua'] = 'اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس يا أرحم الراحمين أنت ربُّ المستضعفين وانت ربّي';
        _res['translation'] = 'اے میرے رب ، میں آپ سے اپنی کمزوری ، مدد کی کمی اور مجھے ذلت کا سامنا کرنے کی شکایت کرتا ہوں۔ نہایت رحم کرنے والا اور رحم کرنے والا! آپ کمزوروں کا رب ہے ، اور آپ میرے رب ہیں۔';
        break;
      case 'peaceful   پُر امن':
        _res['dua'] ='اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ';
        _res['translation'] = 'اے اللہ! میں آپ کی برکتوں کے زوال ، سلامتی کے انتقال ، اچانک آپ کے عذاب کے آغاز سے اور ان سب چیزوں سے پناہ چاہتا ہوں جو آپ کو ناگوار کرتے ہیں۔';
        break;
      case 'regretful    افسوس':
        _res['dua'] = 'اللهمّ إنّي ظلمت نفسي ظلماً كثيراً، ولا يغفر الذّنوب إلا أنت فاغفر لي مغفرة من عندك، وارحمني إنّك أنت الغفور الرّحيم';
        _res['translation'] = 'اے اللہ ، میں اپنے ساتھ بہت ظلم کرتا ہوں اور تیرے علاوہ کوئی بھی گناہ سے معافی نہیں دیتا ہے ، لہذا تو مجھے معافی بخش اور مجھ پر رحم فرما۔ بےشک تو بخشنے والا مہربان ہے';
        break;
      case 'sad    اداس':
        _res['dua'] = 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ';
        _res['translation'] =  'اے اللہ ، میں آپ کو اضطراب اور غم ، کمزوری اور کاہلی ، بداخلاقی اور بزدلی ، قرضوں کے بوجھ اور انسانوں کے طاقت سے زیادہ ہونے سے پناہ مانگتا ہوں';
        break;
      case 'satisfied    مطمئن':
        _res['dua'] ='اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ';
        _res['translation'] = 'اے اللہ! میں آپ کی برکتوں کے زوال ، سلامتی کے انتقال ، اچانک آپ کے عذاب کے آغاز سے اور ان سب چیزوں سے پناہ چاہتا ہوں جو آپ کو ناگوار کرتے ہیں۔';
        break; 
      case 'uncertain    غیر یقینی':
        _res['dua'] = 'اللهم اغسلني من السلبية';
        _res['translation'] = 'اے اللہ میری نفی کو ختم کردے۔';
        break;
      case 'uneasy   آزرده':
        _res['dua'] = 'اللهم أنزِل عليّ سكينة من عندك تشرح بها صدري و تحفظُ بها قلبي';
        _res['translation'] = 'اے اللہ ، مجھ پر اطمینان نازل فرما جو آپ کی طرف سے آتا  ہے اور میرا سینہ کھول کر اس سے میرے دل کی حفاظت  فرما';
        break;
      case 'weak   کمزور':
        _res['dua'] = 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ';
        _res['translation'] =  'اے اللہ ، میں آپ کو اضطراب اور غم ، کمزوری اور کاہلی ، بداخلاقی اور بزدلی ، قرضوں کے بوجھ اور انسانوں کے طاقت سے زیادہ ہونے سے پناہ مانگتا ہوں';
        break;    
      default:
        _res['dua'] = 'other value';
        _res['translation'] = 'other value yet again';
    }
    return _res;
  }