import 'package:aameen/data/regularDuaien.dart';

List<Dua> sleepDua =[
  Dua(
    arabic: "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
    urdu: "اے رب ، تیرے نام کے ساتھ ، میں اپنے آپ کو لیٹا دیتا ہوں۔ اور تیرے نام کے ساتھ میں اٹھتا ہوں۔ اور اگر میری جان لے تو اس پر رحم فرما ، اور اگر تم اسے واپس بھیج دو تو اس کی حفاظت کرو جیسے تم اپنے نیک بندوں کی حفاظت کرو۔",
    count: 1
  ),
  Dua(
    arabic: "اللَّهمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ",
    urdu: "اے اللہ ، تو نے میری روح کو پیدا کیا ہے اور آپ اسے واپس لے لیتے ہیں۔ آپ ہی کے لئے اس کی موت اور اس کی زندگی ہے۔ اگر تم اسے زندگی دو گے تو اس کی حفاظت کرو ، اور اگر تم اسے موت کا سبب بنتے ہو تو اسے معاف کرو۔ اے اللہ میں تجھ سے طاقت مانگتا ہوں",
    count: 1
  ),
  Dua(
    arabic: "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
    urdu: "اے اللہ مجھے اس دن اپنے عذاب سے بچا جس دن تم اپنے بندوں کو زندہ کرو گے",
    count: 3
  ),
  Dua(
    arabic: "اللَّهُمَّ بِاسْـمِكَ أَمُوتُ وَأَحْيَا",
    urdu: "اے اللہ ، تیرے نام پر میں زندہ ہوں اور مروں گا۔",
    count: 1
  ),
  Dua(
    arabic: "اَلْحَمْدُ للهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لا كَافِيَ لَه ُُ وَلا مُؤْوِي",
    urdu: "تمام تعریفیں اس اللہ کے لیئے جس نے ہمیں کھانے پینے کی چیزیں مہیا کیں ، ہمیں کافی بنایا اور ہمارے لئے ٹھکانے لگائے کہ کتنے ہیں وہاں رزق اور گھر نہیں ہے",
    count: 1
  ),
  Dua(
    arabic: "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاواتِ والْأَرْضَ، رَبَّ كُلِّ شَيْءٍ وَمَلِكُهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    urdu: "اے اللہ ، غیب اور ظاہر والا ، آسمانوں اور زمین کا خالق ، ہر چیز کا مالک اور اس کا مالک ، میں گواہی دیتا ہوں کہ تیرے سوا کوئی عبادت کا لائق نہیں ہے۔ میں اپنی جان کی برائی اور شیطان اور اس کے مددگاروں کی شر سے تیری پناہ مانگتا ہوں۔ (میں آپ کی پناہ مانگتا ہوں) اپنی جان کو برا پہنچانے اور کسی مسلمان کو نقصان پہنچانے سے۔",
    count: 1
  ),
  Dua(
    arabic: "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلّا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
    urdu: "اے اللہ ، میں اپنے آپ کو آپ کے سپرد کرتا ہوں ، اپنے معاملات آپ کے سپرد کرتا ہوں ، اپنا چہرہ آپ کی طرف موڑتا ہوں ، اور آپ پر منحصر ہوتا ہوں ، آپ سے امید کرتا ہوں اور آپ سے ڈرتا ہوں۔ تیرے سوا کوئی پناہ نہیں ، اور نہ ہی کوئی بچاؤ۔ میں آپ کی کتاب (قرآن) پر یقین کرتا ہوں جو آپ نے نازل کیا ، اور نبی. جس کو آپ نے بھیجا ہے۔",
    count: 1
  ),
  Dua(
    arabic: "اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    urdu: "خدا (وہ معبود برحق ہے کہ) اس کے سوا کوئی عبادت کے لائق نہیں زندہ ہمیشہ رہنے والا اسے نہ اونگھ آتی ہے نہ نیند جو کچھ آسمانوں میں اور جو کچھ زمین میں ہیں سب اسی کا ہے کون ہے جو اس کی اجازت کے بغیر اس سے (کسی کی) سفارش کر سکے جو کچھ لوگوں کے روبرو ہو رہا ہے اور جو کچھ ان کے پیچھے ہوچکا ہے اسے سب معلوم ہے اور وہ اس کی معلومات میں سے کسی چیز پر دسترس حاصل نہیں کر سکتے ہاں جس قدر وہ چاہتا ہے (اسی قدر معلوم کرا دیتا ہے) اس کی بادشاہی (اور علم) آسمان اور زمین سب پر حاوی ہے اور اسے ان کی حفاظت کچھ بھی دشوار نہیں وہ بڑا عالی رتبہ اور جلیل القدر ہے",
    count: 1
  ),
  Dua(
    arabic: "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ۝ قُلْ هُوَ اللهُ أَحَدٌ ۝ اللهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
    urdu: "شروع الله کے نام سے جو بڑا مہربان نہایت رحم والا ہے ِکہو کہ وہ (ذات پاک جس کا نام) الله (ہے) ایک ہے . معبود برحق جو بےنیاز ہے .  نہ کسی کا باپ ہے اور نہ کسی کا بیٹا. اور کوئی اس کا ہمسر نہیں",
    count: 1
  ),
  Dua(
    arabic: "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ۝ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِنْ شَرِّ مَا خَلَقَ ۝ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    urdu: "شروع الله کے نام سے جو بڑا مہربان نہایت رحم والا ہے ِ. کہو کہ میں صبح کے پروردگار کی پناہ مانگتا ہوں . ہر چیز کی بدی سے جو اس نے پیدا کی . اور شب تاریکی کی برائی سے جب اس کااندھیرا چھا جائے . اور گنڈوں پر (پڑھ پڑھ کر) پھونکنے والیوں کی برائی سے . اور حسد کرنے والے کی برائی سے جب حسد کرنے لگے",
    count: 1
  ),
  Dua(
    arabic: "بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ۝ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝  اِلٰهِ النَّاسِۙ‏  ۝ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَالنَّاسِ",
    urdu: "شروع الله کے نام سے جو بڑا مہربان نہایت رحم والا ہے ِ. کہو کہ میں لوگوں کے پروردگار کی پناہ مانگتا ہوں . (یعنی) لوگوں کے حقیقی بادشاہ کی . لوگوں کے معبود برحق کی . (شیطان) وسوسہ انداز کی برائی سے جو (خدا کا نام سن کر) پیچھے ہٹ جاتا ہے . جو لوگوں کے دلوں میں وسوسے ڈالتا ہے . وہ جنّات میں سے (ہو) یا انسانوں میں سے",
    count: 1
  ),
  Dua(
    arabic: "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ۝ لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    urdu: "رسول (خدا) اس کتاب پر جو ان کے پروردگار کی طرف سے ان پر نازل ہوئی ایمان رکھتے ہیں اور مومن بھی۔ سب خدا پر اور اس کے فرشتوں پر اور اس کی کتابوں پر اور اس کے پیغمبروں پر ایمان رکھتے ہیں (اورکہتے ہیں کہ) ہم اس کے پیغمبروں سے کسی میں کچھ فرق نہیں کرتے اور وہ (خدا سے) عرض کرتے ہیں کہ ہم نے (تیرا حکم) سنا اور قبول کیا۔ اے پروردگار ہم تیری بخشش مانگتے ہیں اور تیری ہی طرف لوٹ کر جانا ہے۔ خدا کسی شخص کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا۔ اچھے کام کرے گا تو اس کو ان کا فائدہ ملے گا برے کرے گا تو اسے ان کا نقصان پہنچے گا۔ اے پروردگار اگر ہم سے بھول یا چوک ہوگئی ہو تو ہم سے مؤاخذہ نہ کیجیو۔ اے پروردگار ہم پر ایسا بوجھ نہ ڈالیو جیسا تو نے ہم سے پہلے لوگوں پر ڈالا تھا۔ اے پروردگار جتنا بوجھ اٹھانے کی ہم میں طاقت نہیں اتنا ہمارے سر پر نہ رکھیو۔ اور (اے پروردگار) ہمارے گناہوں سے درگزر کر اور ہمیں بخش دے۔ اور ہم پر رحم فرما۔ تو ہی ہمارا مالک ہے اور ہم کو کافروں پر غالب فرما۔ ",
    count: 1
  ),
  Dua(
    arabic: "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أّنْتَ آخِذٌ بِنَاصِيَتهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ",
    urdu: "اے اللہ! سات آسمانوں کا مالک اور زبردست عرش کا مالک۔ ہمارا رب اور ہر چیز کا مالک۔ اناج اور کھجور کا الگ ہونا ، تورات اور انجیل اور فرقان (قرآن مجید) کا انکشاف ، میں ہر چیز کی برائی سے تیری پناہ مانگتا ہوں جسے تم پیشانی کے ذریعہ پکڑو گے۔ اے اللہ آپ سب سے پہلے ہیں اور آپ کے سامنے کچھ نہیں آیا ، اور آپ ہی آخری ہیں ، اور آپ کے بعد کچھ نہیں آسکتا ہے۔ آپ سب سے اعلی ہیں ، آپ کے اوپر کچھ بھی نہیں ہے اور آپ قریب ترین ہیں اور کچھ بھی آپ کے قریب نہیں ہے۔ ہم سے اپنے قرضوں کو دور کریں اور ہمیں غربت کے خلاف مالا مال کریں",
    count: 1
  ),
  Dua(
    arabic: "سُبْحَانَ اللهِ",
    urdu: "اللہ بڑی عظمت والا ہے",
    count: 33,
  ),
  Dua(
    arabic: "الْحَمْدُ للهِ",
    urdu: "سب تعریفیں الله کے لیے ہیں",
    count: 33,
  ),
  Dua(
    arabic: "اللهُ أَكْبَرُ",
    urdu: "اللہ بہت بڑا ہے",
    count: 34,
  ),
  Dua(
    arabic: "Recite Surah Mulk and Surah Sajdah",
    urdu: "سورہ الملک اور سورہ سجدہ کی تلاوت کریں",
    count: 1
  ),
];